{"class_name": "Sequential", "keras_version": "2.0.4", "config": [{"class_name": "Reshape", "config": {"dtype": "float32", "name": "reshape_1", "batch_input_shape": [null, 50, 50], "trainable": true, "target_shape": [50, 50, 1]}}, {"class_name": "Conv2D", "config": {"activation": "relu", "dtype": "float32", "data_format": "channels_last", "padding": "valid", "trainable": true, "use_bias": true, "kernel_regularizer": null, "filters": 30, "batch_input_shape": [null, 50, 50], "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [5, 5], "strides": [1, 1], "name": "conv2d_1", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"activation": "relu", "data_format": "channels_last", "padding": "valid", "activity_regularizer": null, "trainable": true, "use_bias": true, "kernel_regularizer": null, "filters": 15, "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2d_2", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_2", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.2, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "relu", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "units": 128, "activity_regularizer": null, "bias_constraint": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"activation": "relu", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "units": 50, "activity_regularizer": null, "bias_constraint": null, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"activation": "softmax", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "units": 6, "activity_regularizer": null, "bias_constraint": null, "name": "dense_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "backend": "tensorflow"}