
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 40, 40, 3)    0                                            
__________________________________________________________________________________________________
conv_1 (Conv2D)                 (None, 36, 36, 30)   2280        input_1[0][0]                    
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 18, 18, 30)   0           conv_1[0][0]                     
__________________________________________________________________________________________________
conv_2 (Conv2D)                 (None, 14, 14, 15)   11265       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 7, 7, 15)     0           conv_2[0][0]                     
__________________________________________________________________________________________________
conv_3 (Conv2D)                 (None, 5, 5, 10)     1360        max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 250)          0           conv_3[0][0]                     
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 250)          0           flatten_1[0][0]                  
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 400)          100400      dropout_1[0][0]                  
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 400)          0           dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 200)          80200       dropout_2[0][0]                  
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 200)          0           dense_2[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 100)          20100       dropout_3[0][0]                  
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 100)          0           dense_3[0][0]                    
__________________________________________________________________________________________________
forward (Dense)                 (None, 1)            101         dropout_4[0][0]                  
__________________________________________________________________________________________________
sideways (Dense)                (None, 1)            101         dropout_4[0][0]                  
__________________________________________________________________________________________________
rotation (Dense)                (None, 1)            101         dropout_4[0][0]                  
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 3)            0           forward[0][0]                    
                                                                 sideways[0][0]                   
                                                                 rotation[0][0]                   
==================================================================================================
Total params: 215,908
Trainable params: 215,908
Non-trainable params: 0
__________________________________________________________________________________________________
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            (None, 40, 40, 3)    0                                            
__________________________________________________________________________________________________
conv_1 (Conv2D)                 (None, 36, 36, 30)   2280        input_2[0][0]                    
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 18, 18, 30)   0           conv_1[0][0]                     
__________________________________________________________________________________________________
conv_2 (Conv2D)                 (None, 14, 14, 15)   11265       max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 7, 7, 15)     0           conv_2[0][0]                     
__________________________________________________________________________________________________
conv_3 (Conv2D)                 (None, 5, 5, 10)     1360        max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 250)          0           conv_3[0][0]                     
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 250)          0           flatten_2[0][0]                  
__________________________________________________________________________________________________
input_3 (InputLayer)            (None, 3)            0                                            
__________________________________________________________________________________________________
state_1 (Dense)                 (None, 200)          50200       dropout_5[0][0]                  
__________________________________________________________________________________________________
action_1 (Dense)                (None, 200)          800         input_3[0][0]                    
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 400)          0           state_1[0][0]                    
                                                                 action_1[0][0]                   
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 400)          0           concatenate_2[0][0]              
__________________________________________________________________________________________________
mlp_1 (Dense)                   (None, 200)          80200       dropout_6[0][0]                  
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 200)          0           mlp_1[0][0]                      
__________________________________________________________________________________________________
mlp_2 (Dense)                   (None, 100)          20100       dropout_7[0][0]                  
__________________________________________________________________________________________________
dropout_8 (Dropout)             (None, 100)          0           mlp_2[0][0]                      
__________________________________________________________________________________________________
critic_q_value (Dense)          (None, 1)            101         dropout_8[0][0]                  
==================================================================================================
Total params: 166,306
Trainable params: 166,306
Non-trainable params: 0
__________________________________________________________________________________________________

Process finished with exit code 0
